Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/G61B.tmx
Source language: en_us
Languages: zh_cn

source: The Amazing Life of Lady Cathcart
zh_cn: 凯斯卡特夫人的传奇一生

source: For most holidaymakers, a visit to Ireland should be an unforgettable experience, and that is certainly the description Lady Elizabeth Cathcart would have used to describe her first, and last, visit to its shores back in 1746.
zh_cn: 对大多数假日游客来说，一次爱尔兰之旅应该会是一次难忘的经历，这也确实是伊丽莎白凯斯卡特夫人会用来描述她在1746年的第一次也是最后一次爱尔兰之旅的。

source: Born in 1691, the daughter of a London brewer, Elizabeth Malyn was described as 'a picture of youth, health, beauty, and modesty' by one of her many ardent admirers.
zh_cn: 出生于1691年，一个伦敦啤酒制造商的女儿，伊丽莎白马林被她众多狂热的仰慕者中的一位看做青春、健康、美丽和谦虚的化身。

source: Her first marriage was to James Fleet, the son of the Lord Mayor of London.
zh_cn: 她的第一次婚姻是和詹姆斯弗利特，伦敦市长的儿子。

source: When he died in 1733, leaving her Tewin Water, a large mansion in the county of Hertfordshire, she married her next-door neighbour, Colonel Sabine, a brother of the governor of Gibraltar.
zh_cn: 当他在1733年去世的时候，给她留下了特万沃特庄园，位于（英格兰东南部的）赫特福德郡的一座豪宅。后来她嫁给了她的邻居，萨拜恩上校，直布罗陀总督的一个兄弟。

source: This second union lasted six years, and, on the death of Colonel Sabine, she married Lord Cathcart, a governor of Londonderry and commander of the British forces in America.
zh_cn: 这第二段婚姻持续了六年，然后，在萨拜恩上校去世之时，她嫁给了洛德凯斯卡特，一个伦敦德里的州长兼驻美英国军队的指挥官。

source: He died, a year later, of endemic fever whilst leading an unsuccessful military expedition in the West Indies.
zh_cn: 一年之后，他在领导一次失败的军队远征西印度群岛时死于当地的一种发热病。

source: Confiding to a close friend, Lady Cathcart said that her first marriage had been to please her parents, her second for money, and her third for a title.
zh_cn: 凯斯卡特夫人曾像她的密友吐露说她的第一次婚姻本就是为了取悦她的父母的，第二段婚姻是为了钱，而第三段婚姻则是为了头衔。

source: Indeed, she declared, if she married a fourth time, it would be for love.
zh_cn: 事实上，她曾说过，假如她结第四次婚，那将会是为了爱。

source: In 1745, on a visit to Bath, she met Colonel Hugh Maguire, a dashing, handsome, officer in the service of the Queen of Hungary, and a descendant of the Maguires of Tempo in County Fermanagh.
zh_cn: 1745年，一次去巴思的旅行中，她邂逅了休马圭尔上校，一个为匈牙利女王服务的潇洒帅气的军官，同时还是弗马纳郡坦波马奎尔家族的后裔。

source: He was not at all discouraged by the fifteen-year gap in their ages, and she readily accepted his proposal of marriage.
zh_cn: 他一点也没有被他们之间十五岁的年龄差所困扰，她也愉快地接受了他的求婚。

source: It must have been true love, for just prior to meeting Maguire, who was a catholic, she had contributed ?200 to an anti-popery society.
zh_cn: 这肯定是真爱，在遇见马奎尔之前，她甚至刚刚捐赠了200英镑给反天主教团体，而偏偏马奎尔就是一名天主教。

source: Ever charming and attentive, he willingly agreed to her choice of an amusing inscription within the wedding ring: "If I survive, I will have five".
zh_cn: 曾经迷人又细心的他欣然接受了她选择在婚戒里面刻的字：“假如我活得久，我会有五个。”

source: This, of course, referred to husbands rather than children for she was then 55 years of age.
zh_cn: 这个，当然，是指丈夫而不是孩子，因为那时候她已经五十五岁了。

source: From the events, which follow, however, she was not encouraged to fulfil this resolution.
zh_cn: 然而，接下来发生的事却没有鼓舞她坚持这个决心。

source: Having returned from the honeymoon to Tewin Water, she soon discovered that she had made a dreadful mistake.
zh_cn: 度完蜜月回到特万沃特庄园以后，她很快就发现她犯了一个天大的错误。

source: Hugh Maguire was passionately in love, but only with her fortune.
zh_cn: 休马圭尔疯狂爱上的只是她的财产。

source: He seized all the money on which he could lay his hands, and then demanded the deeds of the property.
zh_cn: 他抓住了所有他可以掌控的财产，然后是房产证。

source: Lady Cathcart, however, managed to hide these in a compartment behind a secret door in one of her favourite rooms.
zh_cn: 然而，凯斯卡特夫人成功地把这些藏到了她最喜欢的其中一个房间暗门后面的一个隔间里。

source: She also concealed items of jewellery by plaiting some into her hair and quilting others into her petticoats.
zh_cn: 她也通过编进她的头发，缝进她的衬裙等方法藏起了一些珠宝。

source: Then, one warm September morning, while they were out for a coach ride, Maguire informed her that they would not be returning home, but that they were on the high road to Holyhead bound for Ireland.
zh_cn: 那时，一个温暖的九月的早晨，当他们乘坐马车外出的时候，马圭尔告诉她，他们不会返回家里，而是在去霍利黑德的路上要去爱尔兰。

source: At Tewin Water, there was consternation at their disappearance.
zh_cn: 在特万沃特庄园，他们的失踪引起了轩然大波。

source: In his diary, her gardener noted that two geese had been prepared that day for her Ladyship and the Colonel.
zh_cn: 她的园丁在他的日记中写道，那天两只烧鹅已经为夫人和上校准备好了。

source: Rather than see the lunch go to waste, the servants had sat down and helped themselves.
zh_cn: 与其看着午餐白白浪费掉，佣人们都坐到餐桌上自己吃起来。

source: Well, wouldn't we all?
zh_cn: 那么，只有我们这样做吗？

source: A day or two later, some of the Colonel's men appeared and stripped the house of many fixtures and fittings.
zh_cn: 一两天之后，一些上校的人来了然后剥夺了房子里的一些家具和摆设。

source: An attorney was despatched with a writ of Habeas Corpus and he overtook the couple at an inn in Chester.
zh_cn: 一个代理律师带着一张人身保护令被派遣来，然后他在切斯特的一家小旅馆追上了他们。

source: Maguire, however, had one of his mistresses impersonate Lady Cathcart and inform the attorney that she was going to Ireland of her own free will.
zh_cn: 然而，马圭尔的一个情妇冒充凯斯卡特夫人告诉律师说她是自愿去爱尔兰的。

source: He also arranged for three men to follow the attorney and to steal the writ.
zh_cn: 他还派了三个男人跟着那个律师偷走他的令状。

source: With their tracks safely covered, the Maguires crossed the sea to Ireland.
zh_cn: 在他们可靠的监测下，马圭尔他们渡海到了爱尔兰。

source: Maguire had property at Castle Nugent in Co Longford and it is more than likely that he held Lady Cathcart there while she was forced to alter her will making him the main benefactor "in acknowledgement of the tender and affectionate regard which he has always shown for her".
zh_cn: 马圭尔在科朗福德的纽金特城堡有地产，很有可能是在这他强迫凯斯卡特夫人改变意愿让他成为主要代理人“作为他一贯对她展现的温柔和深情的感谢”。

source: This will was executed in Dublin in October 1746.
zh_cn: 这份意愿书于1746年10月在都柏林被执行。

source: After that, their journey continued northwards to Tempo, a small hamlet in Co. Fermanagh, to a large house on an estate, which Maguire had purchased from his brother with the help of money, procured from Lady Cathcart.
zh_cn: 然后，他们继续北上到了坦波，一个弗马纳郡的小村子，住进了一个大房子，那是马圭尔用从凯斯卡特夫人那里设法取得的钱从他的兄弟那里买来的。

source: Upon her arrival at Tempo, she was confined to a 'barrack' or large guest room and there she remained for almost twenty years being allowed only the bare necessities of life.
zh_cn: 当她到达坦波的时候，她被软禁在一个“棚屋”或者大客厅里，并且在这将近二十年里她只被允许拥有生活必需品。

source: Though people in the neighbourhood knew of her incarceration, they also knew that Colonel Maguire was a notorious duellist and had a short fuse. It was better to leave things as they were.
zh_cn: 尽管邻里们都知道她被监禁了，也知道马圭尔上校是一个臭名昭著、脾气暴躁的决斗者，最好还是让事情保持原样。

source: There were regular dinner parties and balls, to which all, except the lady of the manor, were invited.
zh_cn: 平常的晚宴和舞会邀请了所有人，除了这个庄园的女主人。

source: According to Maria Edgeworth, who researched the events in some detail and whose novel Castle Rackrent (1800) has a chapter based loosely on Lady Cathcart's experiences, "it was his regular custom to send a servant with his compliments to Lady Cathcart informing her that the company had the honour to drink her ladyship's health, and begging to know whether there was anything at the table she would wish to have sent to her, the man regularly coming back with Lady Cathcart's compliments and thanks; she had everything she wanted, and she had the honour to drink the company's health."
zh_cn: 玛利亚埃奇沃斯，调查了这些事件的某些细节，在她的小说《拉克伦特堡》中，有一章节大概地描述过凯斯卡特夫人经历的：“他定期派一名仆人，带着他对凯斯卡特夫人的敬意，告诉她，公司很荣幸能为她的健康干杯，并乞求能知道，在桌子上还有什么是她想要让人带来的。仆人定期带回了凯斯卡特夫人的敬意和感谢，她拥有她想要的一切了，同时，她也很荣幸能够为公司的健康干杯。”

source: Back in England, life went on much the same.
zh_cn: 回到英国后，生活照样继续。

source: Under instructions from Maguire, an agent was appointed to let the house and estate at Tewin, and a succession of gamekeepers were registered in the local court.
zh_cn: 在马奎尔的指示下，一个代理人被任命管理房子和特温的房产，一个又一个的猎场看守人被登记在当地的法院。

source: Widowed three times, it was assumed that her ladyship had gone abroad to forget the past and start a new life.
zh_cn: 连续三次守寡，人们都认为，她前往国外是为了忘记过去，开始一段新的生活。
